package interfaces;

public interface God {

    /**
     * Умирает старый еврей. Вокруг кровати стоит вся семья: дети, жена, брат. Дети плачут, взрослые сдержанно пускают слезу. Тут он спрашивает:
     * -Фима, дорогая моя, скажи мне, здесь все собрались?
     * -Все, мой Абрамчик, все
     * -И дети здесь?
     * -Да, Абрам, и Хаим тут, и Розочка, вот она стоит
     * -И брат мой, Изя, тоже здесь?
     * -Таки здесь я - отвечает Изя
     * -Тогда таки почему на кухне свет горит?
     */

    public static String toMagic(String water) {
        return "Вода превращается в вино. ";
    }
    /**
     * Умирает старый еврей. Вокруг кровати стоит вся семья: дети, жена, брат. Дети плачут, взрослые сдержанно пускают слезу. Тут он спрашивает:
     * -Фима, дорогая моя, скажи мне, здесь все собрались?
     * -Все, мой Абрамчик, все
     * -И дети здесь?
     * -Да, Абрам, и Хаим тут, и Розочка, вот она стоит
     * -И брат мой, Изя, тоже здесь?
     * -Таки здесь я - отвечает Изя
     * -Тогда таки почему на кухне свет горит?
     */
    public static void toBeWitness(){
        System.out.print("Бог свидетель: ");
    }
}